; BleConnectScript.get_BleTipContent file_offset=0x1413290 VA=0x1417290
01417290: str      x30, [sp, #-0x20]!
01417294: stp      x20, x19, [sp, #0x10]
01417298: adrp     x19, #0x31b5000
0141729c: adrp     x20, #0x2f75000
014172a0: ldrb     w8, [x19, #0x231]
014172a4: ldr      x20, [x20, #0x260]
014172a8: tbnz     w8, #0, #0x14172c0
014172ac: adrp     x0, #0x2f75000
014172b0: ldr      x0, [x0, #0x260] ; literal "为了启用设备与我们的应用程序进行连接并确保顺利扫描蓝牙设备，低于安卓12的设备我们需要在您的设备上获取位置信息。我们需要访问您的设备的蓝牙功能，蓝牙将仅用于建立连接"
014172b4: bl       #0x12783b0
014172b8: mov      w8, #1
014172bc: strb     w8, [x19, #0x231]
014172c0: ldr      x0, [x20]
014172c4: ldp      x20, x19, [sp, #0x10]
014172c8: ldr      x30, [sp], #0x20
014172cc: ret      
