; EditorVisualInterfaceScript.Unity2BTCommandControl_InEditorStart file_offset=0x2082fd0 VA=0x2086fd0
02086fd0: sub      sp, sp, #0x50
02086fd4: stp      x30, x25, [sp, #0x10]
02086fd8: stp      x24, x23, [sp, #0x20]
02086fdc: stp      x22, x21, [sp, #0x30]
02086fe0: stp      x20, x19, [sp, #0x40]
02086fe4: adrp     x20, #0x48d3000
02086fe8: adrp     x22, #0x4612000
02086fec: mov      x23, x2
02086ff0: ldrb     w8, [x20, #0x748]
02086ff4: ldr      x22, [x22, #0x2f8]
02086ff8: mov      x21, x1
02086ffc: mov      x19, x0
02087000: tbnz     w8, #0, #0x20870f0
02087004: adrp     x0, #0x460f000
02087008: ldr      x0, [x0, #0xe70]
0208700c: bl       #0x1f16e38
02087010: adrp     x0, #0x4611000
02087014: ldr      x0, [x0, #0xb48]
02087018: bl       #0x1f16e38
0208701c: adrp     x0, #0x4610000
02087020: ldr      x0, [x0, #0xa28]
02087024: bl       #0x1f16e38
02087028: adrp     x0, #0x4611000
0208702c: ldr      x0, [x0, #0xb50]
02087030: bl       #0x1f16e38
02087034: adrp     x0, #0x4610000
02087038: ldr      x0, [x0, #0x820]
0208703c: bl       #0x1f16e38
02087040: adrp     x0, #0x4611000
02087044: ldr      x0, [x0, #0x578]
02087048: bl       #0x1f16e38
0208704c: adrp     x0, #0x4610000
02087050: ldr      x0, [x0, #0x7c0]
02087054: bl       #0x1f16e38
02087058: adrp     x0, #0x4611000
0208705c: ldr      x0, [x0, #0x580]
02087060: bl       #0x1f16e38
02087064: adrp     x0, #0x4611000
02087068: ldr      x0, [x0, #0x948]
0208706c: bl       #0x1f16e38
02087070: adrp     x0, #0x4612000
02087074: ldr      x0, [x0, #0x300]
02087078: bl       #0x1f16e38
0208707c: adrp     x0, #0x4612000
02087080: ldr      x0, [x0, #0x2f8]
02087084: bl       #0x1f16e38
02087088: adrp     x0, #0x4612000
0208708c: ldr      x0, [x0, #0x308]
02087090: bl       #0x1f16e38
02087094: adrp     x0, #0x4612000
02087098: ldr      x0, [x0, #0x310] ; literal "人形初始位置-->V-->"
0208709c: bl       #0x1f16e38
020870a0: adrp     x0, #0x4611000
020870a4: ldr      x0, [x0, #0xb70] ; literal "进入编程模式接收到重复指令-->ID-->{0}"
020870a8: bl       #0x1f16e38
020870ac: adrp     x0, #0x4611000
020870b0: ldr      x0, [x0, #0xb78] ; literal "进入编程模式结束,接收到数据条数-->{0}"
020870b4: bl       #0x1f16e38
020870b8: adrp     x0, #0x4611000
020870bc: ldr      x0, [x0, #0xb80] ; literal "进入编程模式接收到数据ID-->{0}"
020870c0: bl       #0x1f16e38
020870c4: adrp     x0, #0x4612000
020870c8: ldr      x0, [x0, #0x318] ; literal "收到开始返回值"
020870cc: bl       #0x1f16e38
020870d0: adrp     x0, #0x4611000
020870d4: ldr      x0, [x0, #0xb88] ; literal "收到不属于当前界面的同类调用-->Unity2BTCommandControl_InEditorStart"
020870d8: bl       #0x1f16e38
020870dc: adrp     x0, #0x4611000
020870e0: ldr      x0, [x0, #0xb90] ; literal "初始位置数据不是24位"
020870e4: bl       #0x1f16e38
020870e8: mov      w8, #1
020870ec: strb     w8, [x20, #0x748]
020870f0: ldr      x0, [x22]
020870f4: bl       #0x1f170d4
020870f8: mov      x1, xzr
020870fc: mov      x22, x0
02087100: bl       #0x36c1fd0
02087104: cbz      x22, #0x20875d0
02087108: adrp     x24, #0x4612000
0208710c: mov      x20, x22
02087110: mov      x1, x23
02087114: ldr      x24, [x24, #0x308]
02087118: str      x23, [x20, #0x10]!
0208711c: mov      x0, x20
02087120: bl       #0x1f16ddc
02087124: ldr      x8, [x24]
02087128: ldr      x0, [x8, #0x20]
0208712c: add      x8, x0, #0x135
02087130: ldrh     w8, [x8]
02087134: tbnz     w8, #0, #0x208713c
02087138: bl       #0x1f4fe9c
0208713c: ldr      x8, [x0, #0xc0]
02087140: ldr      x0, [x8, #0x10]
02087144: add      x8, x0, #0x135
02087148: ldrh     w8, [x8]
0208714c: tbnz     w8, #0, #0x2087154
02087150: bl       #0x1f4fe9c
02087154: ldr      x8, [x0, #0xb8]
02087158: ldr      x9, [x19]
0208715c: mov      x0, x19
02087160: ldr      x1, [x8]
02087164: ldp      x8, x2, [x9, #0x138]
02087168: blr      x8
0208716c: tbz      w0, #0, #0x20872dc
02087170: adrp     x23, #0x48d3000
02087174: ldrb     w8, [x23, #0x4af]
02087178: cbnz     w8, #0x2087190
0208717c: adrp     x0, #0x4610000
02087180: ldr      x0, [x0, #0xc0]
02087184: bl       #0x1f16e38
02087188: mov      w8, #1
0208718c: strb     w8, [x23, #0x4af]
02087190: cbz      x21, #0x20875d0
02087194: adrp     x8, #0x4610000
02087198: mov      x0, x21
0208719c: ldr      x8, [x8, #0xc0]
020871a0: ldr      x9, [x21]
020871a4: ldr      x8, [x8]
020871a8: ldr      x8, [x8, #0xb8]
020871ac: ldr      x1, [x8, #0x18]
020871b0: ldp      x8, x2, [x9, #0x138]
020871b4: blr      x8
020871b8: tbz      w0, #0, #0x20875b8
020871bc: ldrb     w8, [x19, #0xf8]
020871c0: cbz      w8, #0x20875b8
020871c4: ldr      x8, [x20]
020871c8: cbz      x8, #0x20875d0
020871cc: adrp     x25, #0x460c000
020871d0: add      x1, sp, #8
020871d4: ldr      x25, [x25, #0x1d0]
020871d8: ldr      x8, [x8, #0x10]
020871dc: ldr      x0, [x25, #0x68]
020871e0: str      x8, [sp, #8]
020871e4: bl       #0x1f16fc0
020871e8: adrp     x8, #0x4611000
020871ec: mov      x1, x0
020871f0: mov      x2, xzr
020871f4: ldr      x8, [x8, #0xb80] ; literal "进入编程模式接收到数据ID-->{0}"
020871f8: ldr      x8, [x8]
020871fc: mov      x0, x8
02087200: bl       #0x34fed98
02087204: adrp     x24, #0x460f000
02087208: mov      x21, x0
0208720c: ldr      x24, [x24, #0xe70]
02087210: ldr      x8, [x24]
02087214: ldr      w9, [x8, #0xe4]
02087218: cbnz     w9, #0x2087224
0208721c: mov      x0, x8
02087220: bl       #0x1f16fb8
02087224: mov      x0, x21
02087228: mov      x1, xzr
0208722c: bl       #0x3ff6224
02087230: adrp     x8, #0x4611000
02087234: ldr      x8, [x8, #0xb50]
02087238: ldr      x21, [x19, #0x208]
0208723c: ldr      x0, [x8]
02087240: bl       #0x1f170d4
02087244: adrp     x8, #0x4612000
02087248: mov      x1, x22
0208724c: mov      x3, xzr
02087250: ldr      x8, [x8, #0x300]
02087254: mov      x23, x0
02087258: ldr      x2, [x8]
0208725c: bl       #0x2f645d4
02087260: adrp     x8, #0x4611000
02087264: mov      x0, x21
02087268: mov      x1, x23
0208726c: ldr      x8, [x8, #0xb48]
02087270: ldr      x2, [x8]
02087274: bl       #0x234c56c
02087278: tbz      w0, #0, #0x208731c
0208727c: ldr      x8, [x20]
02087280: cbz      x8, #0x20875d0
02087284: ldr      x8, [x8, #0x10]
02087288: ldr      x0, [x25, #0x68]
0208728c: add      x1, sp, #8
02087290: str      x8, [sp, #8]
02087294: bl       #0x1f16fc0
02087298: adrp     x8, #0x4611000
0208729c: mov      x1, x0
020872a0: mov      x2, xzr
020872a4: ldr      x8, [x8, #0xb70] ; literal "进入编程模式接收到重复指令-->ID-->{0}"
020872a8: ldr      x8, [x8]
020872ac: mov      x0, x8
020872b0: bl       #0x34fed98
020872b4: ldr      x8, [x24]
020872b8: mov      x19, x0
020872bc: ldr      w9, [x8, #0xe4]
020872c0: cbnz     w9, #0x20872cc
020872c4: mov      x0, x8
020872c8: bl       #0x1f16fb8
020872cc: mov      x0, x19
020872d0: mov      x1, xzr
020872d4: bl       #0x3ff6224
020872d8: b        #0x20875b8
020872dc: adrp     x8, #0x460f000
020872e0: ldr      x8, [x8, #0xe70]
020872e4: ldr      x0, [x8]
020872e8: ldr      w8, [x0, #0xe4]
020872ec: cbnz     w8, #0x20872f4
020872f0: bl       #0x1f16fb8
020872f4: adrp     x8, #0x4611000
020872f8: mov      x1, xzr
020872fc: ldr      x8, [x8, #0xb88] ; literal "收到不属于当前界面的同类调用-->Unity2BTCommandControl_InEditorStart"
02087300: ldp      x20, x19, [sp, #0x40]
02087304: ldp      x22, x21, [sp, #0x30]
02087308: ldp      x24, x23, [sp, #0x20]
0208730c: ldr      x0, [x8]
02087310: ldp      x30, x25, [sp, #0x10]
02087314: add      sp, sp, #0x50
02087318: b        #0x3ff6224
0208731c: ldr      x0, [x19, #0x208]
02087320: cbz      x0, #0x20875d0
02087324: adrp     x9, #0x4610000
02087328: ldr      x9, [x9, #0x820]
0208732c: ldr      w10, [x0, #0x1c]
02087330: ldr      x8, [x0, #0x10]
02087334: ldr      x1, [x20]
02087338: ldr      x9, [x9]
0208733c: add      w10, w10, #1
02087340: str      w10, [x0, #0x1c]
02087344: cbz      x8, #0x20875d0
02087348: ldrsw    x10, [x0, #0x18]
0208734c: ldr      w11, [x8, #0x18]
02087350: cmp      w10, w11
02087354: b.hs     #0x2087374
02087358: add      x8, x8, x10, lsl #3
0208735c: add      w9, w10, #1
02087360: str      w9, [x0, #0x18]
02087364: str      x1, [x8, #0x20]!
02087368: mov      x0, x8
0208736c: bl       #0x1f16ddc
02087370: b        #0x2087384
02087374: ldr      x8, [x9, #0x20]
02087378: ldr      x8, [x8, #0xc0]
0208737c: ldr      x2, [x8, #0x70]
02087380: bl       #0x317af18
02087384: ldr      x8, [x20]
02087388: cbz      x8, #0x20875d0
0208738c: ldr      x8, [x8, #0x20]
02087390: cbz      x8, #0x20875d0
02087394: ldr      w8, [x8, #0x18]
02087398: cmp      w8, #1
0208739c: b.ne     #0x20875b8
020873a0: ldr      x8, [x19, #0x208]
020873a4: cbz      x8, #0x20875d0
020873a8: ldr      w8, [x8, #0x18]
020873ac: ldr      x0, [x25, #0x48]
020873b0: add      x1, sp, #8
020873b4: str      w8, [sp, #8]
020873b8: bl       #0x1f16fc0
020873bc: adrp     x8, #0x4611000
020873c0: mov      x1, x0
020873c4: mov      x2, xzr
020873c8: ldr      x8, [x8, #0xb78] ; literal "进入编程模式结束,接收到数据条数-->{0}"
020873cc: ldr      x8, [x8]
020873d0: mov      x0, x8
020873d4: bl       #0x34fed98
020873d8: ldr      x8, [x24]
020873dc: mov      x20, x0
020873e0: ldr      w9, [x8, #0xe4]
020873e4: cbnz     w9, #0x20873f0
020873e8: mov      x0, x8
020873ec: bl       #0x1f16fb8
020873f0: mov      x0, x20
020873f4: mov      x1, xzr
020873f8: bl       #0x3ff6224
020873fc: ldr      x0, [x19, #0x208]
02087400: cbz      x0, #0x20875d0
02087404: ldr      w8, [x0, #0x18]
02087408: cmp      w8, #3
0208740c: b.lt     #0x20875a0
02087410: adrp     x21, #0x4611000
02087414: mov      w1, wzr
02087418: ldr      x21, [x21, #0x580]
0208741c: ldr      x2, [x21]
02087420: bl       #0x317ac48
02087424: cbz      x0, #0x20875d0
02087428: adrp     x8, #0x4611000
0208742c: ldr      x8, [x8, #0x948]
02087430: ldr      x1, [x0, #0x20]
02087434: mov      w0, #0x2c
02087438: ldr      x2, [x8]
0208743c: bl       #0x24b8f10
02087440: adrp     x8, #0x4612000
02087444: mov      x1, x0
02087448: mov      x2, xzr
0208744c: ldr      x8, [x8, #0x318] ; literal "收到开始返回值"
02087450: ldr      x8, [x8]
02087454: mov      x0, x8
02087458: bl       #0x35011e4
0208745c: ldr      x8, [x24]
02087460: mov      x20, x0
02087464: ldr      w9, [x8, #0xe4]
02087468: cbnz     w9, #0x2087474
0208746c: mov      x0, x8
02087470: bl       #0x1f16fb8
02087474: mov      x0, x20
02087478: mov      x1, xzr
0208747c: bl       #0x3ff6cc4
02087480: ldr      x0, [x19, #0x208]
02087484: cbz      x0, #0x20875d0
02087488: ldr      x2, [x21]
0208748c: mov      w1, wzr
02087490: bl       #0x317ac48
02087494: cbz      x0, #0x20875d0
02087498: ldr      x8, [x0, #0x20]
0208749c: cbz      x8, #0x20875d0
020874a0: ldr      w8, [x8, #0x18]
020874a4: cmp      w8, #0x18
020874a8: b.ne     #0x2087574
020874ac: ldr      x0, [x19, #0x208]
020874b0: cbz      x0, #0x20875d0
020874b4: ldr      x2, [x21]
020874b8: mov      w1, wzr
020874bc: bl       #0x317ac48
020874c0: cbz      x0, #0x20875d0
020874c4: ldr      x8, [x0, #0x20]
020874c8: cbz      x8, #0x20875d0
020874cc: ldr      w8, [x8, #0x18]
020874d0: cmp      w8, #0x18
020874d4: b.ne     #0x2087574
020874d8: ldr      x0, [x19, #0x208]
020874dc: strb     wzr, [x19, #0xf8]
020874e0: cbz      x0, #0x20875d0
020874e4: ldr      x2, [x21]
020874e8: mov      w1, wzr
020874ec: bl       #0x317ac48
020874f0: cbz      x0, #0x20875d0
020874f4: adrp     x8, #0x4610000
020874f8: ldr      x8, [x8, #0xa28]
020874fc: ldr      x0, [x0, #0x20]
02087500: ldr      x1, [x8]
02087504: bl       #0x2365770
02087508: mov      x1, x0
0208750c: str      x0, [x19, #0x98]!
02087510: mov      x0, x19
02087514: bl       #0x1f16ddc
02087518: ldr      x0, [x19]
0208751c: mov      x1, xzr
02087520: bl       #0x35f9d70
02087524: adrp     x8, #0x4612000
02087528: mov      x1, x0
0208752c: mov      x2, xzr
02087530: ldr      x8, [x8, #0x310] ; literal "人形初始位置-->V-->"
02087534: ldr      x8, [x8]
02087538: mov      x0, x8
0208753c: bl       #0x35011e4
02087540: ldr      x8, [x24]
02087544: mov      x19, x0
02087548: ldr      w9, [x8, #0xe4]
0208754c: cbnz     w9, #0x2087558
02087550: mov      x0, x8
02087554: bl       #0x1f16fb8
02087558: mov      x0, x19
0208755c: mov      x1, xzr
02087560: bl       #0x3ff6224
02087564: fmov     s0, #1.00000000
02087568: mov      x0, xzr
0208756c: bl       #0x211de68 ; TopCanvasScript.ShowWaiting
02087570: b        #0x20875b8
02087574: ldr      x0, [x24]
02087578: ldr      w8, [x0, #0xe4]
0208757c: cbnz     w8, #0x2087584
02087580: bl       #0x1f16fb8
02087584: adrp     x8, #0x4611000
02087588: mov      x1, xzr
0208758c: ldr      x8, [x8, #0xb90] ; literal "初始位置数据不是24位"
02087590: ldr      x0, [x8]
02087594: bl       #0x3ff6224
02087598: ldr      x0, [x19, #0x208]
0208759c: cbz      x0, #0x20875d0
020875a0: adrp     x8, #0x4611000
020875a4: ldr      x8, [x8, #0x578]
020875a8: ldr      x1, [x8]
020875ac: bl       #0x1c11430
020875b0: mov      w8, #1
020875b4: strb     w8, [x19, #0xf8]
020875b8: ldp      x20, x19, [sp, #0x40]
020875bc: ldp      x22, x21, [sp, #0x30]
020875c0: ldp      x24, x23, [sp, #0x20]
020875c4: ldp      x30, x25, [sp, #0x10]
020875c8: add      sp, sp, #0x50
020875cc: ret      
020875d0: bl       #0x1f170e4
